In [3]:
import pandas as pd

In [6]:
index_arr = ["姓名","年龄","籍贯","部门"]
ser_xiaoming = pd.Series(["小明","22","河北","IT部门"],index=index_arr)
ser_xiaohong = pd.Series(["小红","24","安徽","财务"],index=index_arr)
ser_xioae = pd.Series(["小E","32","湖南","信息"],index=index_arr)
df_info = pd.DataFrame([ser_xiaoming,ser_xiaohong,ser_xioae])
df_info

   姓名  年龄  籍贯    部门
0  小明  22  河北  IT部门
1  小红  24  安徽    财务
2  小E  32  湖南    信息

In [7]:
ser_name= df_info["姓名"]
print(type(ser_name))
print(ser_name)

<class 'pandas.core.series.Series'>
0    小明
1    小红
2    小E
Name: 姓名, dtype: object

In [8]:
result = ser_name[1]
print(result)

小红

In [9]:
sub_df_info = df_info[["姓名","年龄"]]
print(type(sub_df_info))
print(sub_df_info)

<class 'pandas.core.frame.DataFrame'>
   姓名  年龄
0  小明  22
1  小红  24
2  小E  32

In [10]:
sub_ser_name = ser_name[[0,2]]
print(type(sub_ser_name))
print(sub_ser_name)

<class 'pandas.core.series.Series'>
0    小明
2    小E
Name: 姓名, dtype: object

In [11]:
ser_xiaoli = pd.Series(["小李","22","云南","设计部"],index=index_arr)
ser_xiaowang = pd.Series(["小王","20","福建","设计部"],index=index_arr)
df_info = df_info.append(ser_xiaoli,ignore_index=True)
df_info = df_info.append(ser_xiaowang,ignore_index=True)
df_info

   姓名  年龄  籍贯    部门
0  小明  22  河北  IT部门
1  小红  24  安徽    财务
2  小E  32  湖南    信息
3  小李  22  云南   设计部
4  小王  20  福建   设计部

In [12]:
df_info[2:4]

   姓名  年龄  籍贯   部门
2  小E  32  湖南   信息
3  小李  22  云南  设计部

In [13]:
df_info[:2]

   姓名  年龄  籍贯    部门
0  小明  22  河北  IT部门
1  小红  24  安徽    财务

In [14]:
df_info[::2]

   姓名  年龄  籍贯    部门
0  小明  22  河北  IT部门
2  小E  32  湖南    信息
4  小王  20  福建   设计部

In [15]:
df_info[::1]

   姓名  年龄  籍贯    部门
0  小明  22  河北  IT部门
1  小红  24  安徽    财务
2  小E  32  湖南    信息
3  小李  22  云南   设计部
4  小王  20  福建   设计部

In [16]:
df_info[::-1]

   姓名  年龄  籍贯    部门
4  小王  20  福建   设计部
3  小李  22  云南   设计部
2  小E  32  湖南    信息
1  小红  24  安徽    财务
0  小明  22  河北  IT部门

In [17]:
df_info

   姓名  年龄  籍贯    部门
0  小明  22  河北  IT部门
1  小红  24  安徽    财务
2  小E  32  湖南    信息
3  小李  22  云南   设计部
4  小王  20  福建   设计部

In [18]:
df_ser = df_info["部门"]
print("小红的部门",df_ser[1])

小红的部门 财务

In [19]:
print("小红的部门：",df_info.loc[1,"部门"])

小红的部门： 财务

In [20]:
df_info.loc[::-1,["姓名","年龄"]]

   姓名  年龄
4  小王  20
3  小李  22
2  小E  32
1  小红  24
0  小明  22

In [24]:
df_info.iloc[1,3]

'财务'

In [25]:
df_info.loc[df_info["年龄"] >="23", :]

   姓名  年龄  籍贯  部门
1  小红  24  安徽  财务
2  小E  32  湖南  信息

In [29]:
df_info.loc[df_info["姓名"] =="小红", "部门"]

1    财务
Name: 部门, dtype: object

In [30]:
print("小亮的部门："+df_info.loc[df_info["姓名"] == "小红","部门"].iloc[0])

小亮的部门：财务

In [34]:
df_info.loc[(df_info["部门"]=="设计部") & (df_info["年龄"] <"22"),:]

   姓名  年龄  籍贯   部门
4  小王  20  福建  设计部

In [35]:
df_info.loc[(df_info["部门"]=="财务部") | (df_info["部门"] == "设计部"), :]

   姓名  年龄  籍贯   部门
3  小李  22  云南  设计部
4  小王  20  福建  设计部

[n:m]，代表查询从 n 到 m 中间的这一段记录，不写 n 时，代表查询前 m 条数据，n 和 m 都不写时，返回查询全部数据。

[::n]，代表每隔 n 条返回一条，一般用于基于固定的频率采样数据集；[::-1] 代表从后向前逐一返回。

之后，我们学习了查询数据更强大的 loc 和 iloc，关键点如下。

loc 后接[] ，可以一次性传入行索引和列索引，使用逗号隔开，实现了直接取单元格的数据；行索引和列索引都遵循第一部分介绍的各种规则，如多重索引、范围选择等。

iloc 和 loc 类似，只是传入的不是索引，而是第几行、第几列这样的整数。

loc 的行索引部分可以替换为条件表达式，来实现通过条件来选择行，而不是通过固定的行索引。

条件表达式可以组合，& 代表逻辑与，| 代表逻辑或。

In [40]:
# 筛选出年龄在 22~23 的员工的姓名和籍贯，不包含设计部的员工。
df_info.loc[(df_info["年龄"] >="22") & (df_info["年龄"] <="23") & (df_info["部门"] !="设计部"),:]
df_info.loc[(df_info["年龄"] >="22") & (df_info["年龄"] <="23") & (df_info["部门"] !="设计部"),["姓名","籍贯"]]

   姓名  籍贯
0  小明  河北